# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\PROJECTS\PSoC Creator\Project1A.cydsn\Project1A.cyprj
# Date: Wed, 06 Apr 2022 12:00:17 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.333333333333334 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.333333333333334 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {SARADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 63 127} -nominal_period 840 [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 75 151} -nominal_period 1000 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 163 327} [list [get_pins {ClockBlock/dclk_glb_1}]]


# Component constraints for C:\PROJECTS\PSoC Creator\Project1A.cydsn\TopDesign\TopDesign.cysch
# Project: C:\PROJECTS\PSoC Creator\Project1A.cydsn\Project1A.cyprj
# Date: Wed, 06 Apr 2022 12:00:09 GMT
